app/controllers/post_controller.rb

  def create
    newPost = Post.new
    newPost.title = params[:title]
    newPost.content = params[:content]
    newPost.user = current_user
    if params[:avatar]
      newPost.avatar = params[:avatar]
    end
    newPost.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "123"], ["content", "123"], ["user_id", 1], ["created_at", 2017-05-01 01:37:40 UTC], ["updated_at", 2017-05-01 01:37:40 UTC]]

  def destroy
    destroyPost = Post.find(params[:id])
    destroyPost.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

  def index
    @listPost = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @showPost = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @editPost = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    updatePost = Post.find(params[:id])
    updatePost.title = params[:title]
    updatePost.content = params[:content]
    if params[:avatar]
      updatePost.avatar = params[:avatar]
    end
    updatePost.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "4512312324"], ["avatar_file_name", nil], ["avatar_content_type", nil], ["avatar_file_size", nil], ["avatar_updated_at", nil], ["updated_at", 2017-05-01 15:30:14 UTC], ["id", 4]]